<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"ebfca29dd8c61b2ee270b55c2b641f48d23cfe1a82c08a14e527552d1e705ba7","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1371 at https://github.com/cal-itp/data-infra/actions/runs/21186015929","plan_out_hash":"4f86e1ea79865b7ff09f516b004069467cc8e09505fa413a72dd47a445c7c892","plan_hash":"f3c0d2ddf276186ee5c150cb522d4c814b2e41e36a84fbfec6969b4a80de86b3","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/gtfs_schedule_v2/gtfs_schedule_json_outcomes/gtfs_schedule_fare_media_txt_json_outcomes.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "t/sKtg==" -> (known after apply)
!~      detect_md5hash      = "P8DJIhO0mQ78KruaCPVbfQ==" -> "different hash"
!~      generation          = 1749661099515912 -> (known after apply)
        id                  = "calitp-staging-composer-dags/create_external_tables/gtfs_schedule_v2/gtfs_schedule_json_outcomes/gtfs_schedule_fare_media_txt_json_outcomes.yml"
!~      md5hash             = "P8DJIhO0mQ78KruaCPVbfQ==" -> (known after apply)
        name                = "dags/create_external_tables/gtfs_schedule_v2/gtfs_schedule_json_outcomes/gtfs_schedule_fare_media_txt_json_outcomes.yml"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1371](https://github.com/cal-itp/data-infra/actions/runs/21186015929)